#+title:     Linux Builder
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2024-10-01 Tue>
#+language:  en
#+file_tags:
#+tags:

The Linux Builder refers to a specialized VM that runs on macOS to allow it to
build Linux binaries.  It follows the machine's architecture but simply adds a
new OS.  So an ~aarch64-darwin~ machine gets a ~aarch64-linux~ machine.  A
~x86_64-darwin~ machine gets a ~x86_64-linux~ machine.

** Machine is unreachable

You may not be able to SSH to the host, or you see this in your build log:

#+begin_example
cannot build on 'ssh-ng://builder@linux-builder': error: failed to start SSH
connection to 'builder@linux-builder'
#+end_example


First, verify that ~nix.linux-builder.enable~ is ~true~.  This can be found in
[[file:./darwin-linux-builder-module.nix]].

Second, verify the virtual machine process is running.  This is generally a
~qemu-system-*~ process.

#+begin_src sh :results output :exports code :tangle yes :cache yes
ps aux | grep qemu | grep --invert-match grep
#+end_src

#+RESULTS[53a5165db705033374bb8b714d22a2147b259d3a]:
: root             59361   0.0  0.0        0      0   ??  ?     5:59PM   0:00.00 (qemu-system-aarc)

If this is present and the host is unreachable, use ~sudo kill $pid~ (no ~-9~
should be necessary).  Toggle ~nix.linux-builder.enable~ to ~false~, run
~nix-darwin-switch~, toggle back to ~true~, run again.  Now it should be up.

Why does it break down?  This is not well understood at this time.

Further troubleshooting against the host (such as auth failures) should be
diagnosed with ~nix-remote-builder-doctor~.

